Revit 2027 API
ParameterTypeId.TrussNonBearingOffsetParam Property
 "Non Bearing Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TrussNonBearingOffsetParam { get; }
Public Shared ReadOnly Property TrussNonBearingOffsetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TrussNonBearingOffsetParam {
	ForgeTypeId^ get ();
}
static member TrussNonBearingOffsetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace